# Основной модуль: отвечает за запуск и управление браузером
from selenium import webdriver
# Подключаем наш класс страницы из файла pages.py
from pages import CalcPage


# ГЛАВНЫЙ ТЕСТ: проверяет работу медленного калькулятора
def test_slow_calculator():
    # Создаем экземпляр браузера Chrome (запускаем его)
    driver = webdriver.Chrome()
    # Создаем объект нашей страницы и передаем ей открытый браузер
    # В этот момент срабатывает тот самый __init__ и "запоминает" driver
    calc = CalcPage(driver)

    # Вызываем метод открытия сайта
    # (создали его в файле pages.py под именем def open(self))
    calc.open()
    # Вызываем метод для ввода задержки (передаем 45 секунд)
    calc.set_delay("45")

    # Последовательно нажимаем кнопки, вызывая метод клика
    calc.click_button("7")
    calc.click_button("+")
    calc.click_button("8")
    calc.click_button("=")

    # Запускаем метод ожидания и получения результата
    # Передаем 50 секунд как максимальное время, которое мы готовы ждать
    result = calc.get_result(50)

    # ПРОВЕРКА (Assert): сравниваем то, что выдал калькулятор, с числом "15"
    assert result == "15"

    # Завершаем работу: закрываем браузер и освобождаем память
    driver.quit()
